app/controllers/users_controller.rb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."organization_id" = $1 AND "users"."id" = $2 LIMIT $3  [["organization_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @user = current_user.organization.users.find(params[:id])